Bookers2/app/controllers/books_controller.rb

  def create
    # ストロングパラメーターを使用
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    # DBへ保存する
    if @book.save
    #   redirect_to book_path(@book.id) , notice: 'Book was successfully created'
    # else
    # # @books = Book.all
    # # @user = User.find(params[:id])
    # # @book = Book.new
    # # render "index"
    #   # redirect_to books_path
    # end
    # redirect_to book_path(@book.id), notice: 'Book was successfully created.'
    # @book = Book.new(book_params)
    redirect_to book_path(@book.id) , notice: 'Book was successfully created'


    else
      @books =Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "tset"], ["user_id", "1"], ["created_at", "2020-08-03 16:31:49.961443"], ["updated_at", "2020-08-03 16:31:49.961443"]]
SELECT "books".* FROM "books"

  def index
    if user_signed_in?
    @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    if user_signed_in?
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit

    if @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
    # @book.user_id = current_user.id
    if  @book.update(book_params)
      # redirect_to "/books/:id"
      redirect_to book_path , notice: 'Book was successfully updated.'
    else
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "te"], ["updated_at", "2020-08-07 16:01:54.618808"], ["id", 19]]

  def destroy
       # dbから削除する命令
    # リダイレクトする命令
    book = Book.find(params[:id]) #データ(レコード)を1件取得
    book.destroy #データ（レコード）を削除
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 18]]